"""ТАБЛИЦА ЗАМЕНЫ С S1 - S8 СТРОКАМИ ПО 16 ЭЛЕМЕНТОВ"""
replace_table = [
    [7, 12, 0, 5, 14, 3, 9, 10, 1, 11, 15, 6, 4, 8, 2, 13],  # S1
    [1, 6, 10, 5, 7, 9, 12, 3, 13, 8, 0, 15, 14, 2, 11, 4],  # S2
    [11, 5, 7, 14, 4, 3, 13, 0, 8, 6, 2, 9, 15, 10, 1, 12],  # S3
    [9, 14, 0, 13, 15, 3, 5, 8, 6, 11, 10, 7, 1, 4, 12, 2],  # S4
    [15, 4, 12, 11, 5, 8, 2, 1, 10, 9, 6, 0, 3, 14, 13, 7],  # S5
    [8, 2, 4, 11, 7, 12, 13, 1, 5, 15, 3, 6, 14, 9, 0, 10],  # S6
    [10, 5, 0, 12, 13, 2, 7, 9, 4, 3, 11, 6, 14, 8, 1, 15],  # S7
    [7, 0, 9, 5, 12, 6, 10, 3, 8, 11, 15, 2, 1, 13, 4, 14]   # S8
]


def table_swap(mas):
    """ТАБЛИЧНАЯ ЗАМЕНА"""
    """ 
    Проходим по всмем элементам бинарного списка
    i = номер строки в таблице замены (1-8)
    j = позиция цифры (0-15) которую нужно заменить
    """
    swap_digit = []
    for i in range(0, 8):
        j = int(mas[i])
        swap_digit.append(replace_table[i][j])

    return swap_digit
